In [1]:
import pandas as pd
import numpy as np

Dans les prochaines vidéos, nous allons apprendre à utiliser plusieurs fichiers csv en même temps.

In [2]:
clients = pd.read_csv("clients.csv", sep=';',  encoding='windows-1252')
clients.head()

   id      nom     prenom                 societe     fonction
0   1  BRODEAU     Daniel                  ORANGE    boulanger
1   2  LAMBERT    Jacques  TOTAL MARKETING FRANCE      manager
2   3  MONNIER    Sylvain                   ENGIE  developpeur
3   4  REGNIER    Bernard                     CSF    webmaster
4   5  REGNIER  Elisabeth      SOCIETE AIR FRANCE   secretaire

In [3]:
produits = pd.read_csv("produits.csv", sep=';',  encoding='windows-1252')
produits.head()

   idproduit          produit
0          1           crayon
1          2  bouteille d'eau
2          3        vin rouge
3          4             pate
4          5             café

In [4]:
semaine1 = pd.read_csv("semaine 1.csv", sep=';',  encoding='windows-1252')
semaine1.head()

   idclient  idproduit
0       512          3
1       499          3
2       499         13
3        11          9
4        24         19

In [5]:
semaine2 = pd.read_csv("semaine 2.csv", sep=';',  encoding='windows-1252')
semaine2.head()

   idclient  idproduit
0       536          7
1       499          7
2       499          5
3       499          1
4        38         14